updating docs and graph renderer
